# This is a list of package to install after base install of Arch

# The script will assume that git and openssh is install and that you added your public key to your github account

# video
mesa
xf86-video-ati
lib32-mesa
mesa-vdpau
lib32-mesa-vdpau

# Base
base-devel
pacman-contrib
vim
neovim
zsh
python3
python-pip


# Desktop package
light-dm
light-dm-gtk-greeter
xorg
bspwm
sxhkd
picom
noto-fonts
rofi
polybar # Before compiling, make sure you have pkg-config, cairo, libxcb, python3,xcb-util-image-xcb-util-wm, python-sphinx, xcb-xkb, alsa-lib, libpulse, libmpdclient, libcurl, libnl-genl or wireless-tools, xcb-util-cursor, xcb-util-xrm
polybar-spotify # need python-dbus, python-dbus-common
alacritty
feh

# application
firefox
spotify
bitwarden
thunar

# Utility
exa
unzip
xclip
tty-clock
brightnessctl

# networking

networkmanager
wpa_supplicant
nm-applet



